---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.NormalMaterial
enum: Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType
source: html/b614bf20-7f12-a7f1-4b63-f151a6960c6f.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.NormalMaterial

The visualization material for the MassSurfaceData will be taken from the material
 associated with the object style of the subcategory of the MassSurfaceData if the
 materialId is InvalidElementId, or the MassSurfaceData will use the specific material
 indicated by the materialId property if its value is an ElementId of a MaterialElement.